In [110]:
import pandas as pd

In [111]:
people = {
    "first": ["Jerin", "Jane", "John"],
    "last": ["Thomas", "Doe", "Doe"],
    "email": ["jerinthomas17@gmail.com", "janedoe@email.com", "johndoe@email.com"]
}

In [112]:
# dict to df
df = pd.DataFrame(people)

In [113]:
df

   first    last                    email
0  Jerin  Thomas  jerinthomas17@gmail.com
1   Jane     Doe        janedoe@email.com
2   John     Doe        johndoe@email.com

In [114]:
# df.email
# df.email == df['email']
# But in case email is an attribute, (.) operator can be problematic
# df.count returns count attribute/method rather than count column
df['email']

0    jerinthomas17@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [115]:
type(df['email'])

pandas.core.series.Series

In [116]:
df[['last', 'email']]

     last                    email
0  Thomas  jerinthomas17@gmail.com
1     Doe        janedoe@email.com
2     Doe        johndoe@email.com

In [117]:
type(df[['last', 'email']])

pandas.core.frame.DataFrame

In [118]:
# get columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [119]:
# get rows: loc and iloc - location and index-location
df.iloc[0]

first                      Jerin
last                      Thomas
email    jerinthomas17@gmail.com
Name: 0, dtype: object

In [120]:
df.iloc[[0, 1]]

   first    last                    email
0  Jerin  Thomas  jerinthomas17@gmail.com
1   Jane     Doe        janedoe@email.com

In [121]:
df.iloc[[0, 1], 2]

0    jerinthomas17@gmail.com
1          janedoe@email.com
Name: email, dtype: object

In [122]:
df

   first    last                    email
0  Jerin  Thomas  jerinthomas17@gmail.com
1   Jane     Doe        janedoe@email.com
2   John     Doe        johndoe@email.com

In [123]:
df.loc[0]
df.loc[[0,1], ['email', 'first']]

                     email  first
0  jerinthomas17@gmail.com  Jerin
1        janedoe@email.com   Jane

In [124]:
df.set_index('email')    #doesn't modify the index

                         first    last
email
jerinthomas17@gmail.com  Jerin  Thomas
janedoe@email.com         Jane     Doe
johndoe@email.com         John     Doe

In [125]:
df

   first    last                    email
0  Jerin  Thomas  jerinthomas17@gmail.com
1   Jane     Doe        janedoe@email.com
2   John     Doe        johndoe@email.com

In [126]:
df.set_index('email', inplace=True)   #modifies the df and index changes
df

                         first    last
email
jerinthomas17@gmail.com  Jerin  Thomas
janedoe@email.com         Jane     Doe
johndoe@email.com         John     Doe

In [127]:
df.loc['jerinthomas17@gmail.com']

first     Jerin
last     Thomas
Name: jerinthomas17@gmail.com, dtype: object

In [128]:
df.reset_index(inplace=True)   #modifies the df and index changes
# df = df.reset_index(drop=True)
df

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas
1        janedoe@email.com   Jane     Doe
2        johndoe@email.com   John     Doe

Filtering

In [129]:
df['last'] == 'Doe'
filt = (df['last'] == 'Doe')

In [130]:
df[filt]
df[df['last'] == 'Doe']

               email first last
1  janedoe@email.com  Jane  Doe
2  johndoe@email.com  John  Doe

In [131]:
df.loc[filt]

               email first last
1  janedoe@email.com  Jane  Doe
2  johndoe@email.com  John  Doe

In [132]:
df.loc[filt, 'email']

1    janedoe@email.com
2    johndoe@email.com
Name: email, dtype: object

In [133]:
# AND, OR keyword : & and |

df[(df['last']=='Doe') & (df['first']=='John')]

               email first last
2  johndoe@email.com  John  Doe

In [134]:
df[(df['last']=='Thomas') | (df['first']=='Jane')]

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas
1        janedoe@email.com   Jane     Doe

In [135]:
df[~(df['last']=='Thomas') | (df['first']=='Jane')]

               email first last
1  janedoe@email.com  Jane  Doe
2  johndoe@email.com  John  Doe

Updating Column

In [136]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [137]:
df.columns = ['EMAIL', 'FIRST NAME', 'LAST NAME'] 
df

                     EMAIL FIRST NAME LAST NAME
0  jerinthomas17@gmail.com      Jerin    Thomas
1        janedoe@email.com       Jane       Doe
2        johndoe@email.com       John       Doe

In [138]:
df.columns = [x.lower() for x in df.columns]
df

                     email first name last name
0  jerinthomas17@gmail.com      Jerin    Thomas
1        janedoe@email.com       Jane       Doe
2        johndoe@email.com       John       Doe

In [139]:
df.columns = df.columns.str.replace(' ', '_')
df

                     email first_name last_name
0  jerinthomas17@gmail.com      Jerin    Thomas
1        janedoe@email.com       Jane       Doe
2        johndoe@email.com       John       Doe

In [140]:
df.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)

In [141]:
df

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas
1        janedoe@email.com   Jane     Doe
2        johndoe@email.com   John     Doe

UPDATING DATA

In [142]:
df.loc[1] = ['Johnsmith@email.com', 'John', 'Smith']

In [143]:
df

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas
1      Johnsmith@email.com   John   Smith
2        johndoe@email.com   John     Doe

In [144]:
df.loc[1, ['first', 'last']] = ['John_updated', 'Smith_updated']

In [145]:
df

                     email         first           last
0  jerinthomas17@gmail.com         Jerin         Thomas
1      Johnsmith@email.com  John_updated  Smith_updated
2        johndoe@email.com          John            Doe

In [146]:
df.loc[1, 'last'] = 'Smith_latest'
df

                     email         first          last
0  jerinthomas17@gmail.com         Jerin        Thomas
1      Johnsmith@email.com  John_updated  Smith_latest
2        johndoe@email.com          John           Doe

In [147]:
df.at[1, 'last'] = 'Smith_latest2'   # .at here is same as loc, but proabbly better in performance
df

                     email         first           last
0  jerinthomas17@gmail.com         Jerin         Thomas
1      Johnsmith@email.com  John_updated  Smith_latest2
2        johndoe@email.com          John            Doe

In [148]:
df[(df['first'] == 'Jerin')]

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas

In [149]:
df[(df['first'] == 'Jerin')]['last'] = "Thomas_updated"
# Error in such cases... Can't assign directly with filter

C:\Users\Jerin\AppData\Local\Temp\ipykernel_6400\3296532080.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[(df['first'] == 'Jerin')]['last'] = "Thomas_updated"

In [150]:
df.loc[(df['first'] == 'Jerin'), 'last'] = "Thomas_updated"

In [151]:
df

                     email         first            last
0  jerinthomas17@gmail.com         Jerin  Thomas_updated
1      Johnsmith@email.com  John_updated   Smith_latest2
2        johndoe@email.com          John             Doe

In [152]:
# make all email address to lower case

df['email'] = df['email'].str.upper()
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

4 ways to update:
1. APPLY 
2. MAP
3. APPLYMAP
4. REPLACE

In [153]:
# 1. Apply : used to call function on our values

df['email'].apply(len)

0    23
1    19
2    17
Name: email, dtype: int64

In [154]:
def update_email(email):
    return email.lower()

df['email'].apply(update_email)

0    jerinthomas17@gmail.com
1        johnsmith@email.com
2          johndoe@email.com
Name: email, dtype: object

In [155]:
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

In [156]:
df['email'] = df['email'].apply(update_email) # assigned it to a series
df

                     email         first            last
0  jerinthomas17@gmail.com         Jerin  Thomas_updated
1      johnsmith@email.com  John_updated   Smith_latest2
2        johndoe@email.com          John             Doe

In [157]:
df['email'] = df['email'].apply(lambda x: x.upper())
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

In [158]:
print(df.apply(len)) #rows = default
print(df.apply(len, axis='columns'))
print(df.apply(pd.Series.min))
print(df.apply(lambda x: x.min()))

email    3
first    3
last     3
dtype: int64
0    3
1    3
2    3
dtype: int64
email    JERINTHOMAS17@GMAIL.COM
first                      Jerin
last                         Doe
dtype: object
email    JERINTHOMAS17@GMAIL.COM
first                      Jerin
last                         Doe
dtype: object

In [159]:
# 2. Apply map: applies it to entire df
df.applymap(len)
df.applymap(str.upper)

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         JERIN  THOMAS_UPDATED
1      JOHNSMITH@EMAIL.COM  JOHN_UPDATED   SMITH_LATEST2
2        JOHNDOE@EMAIL.COM          JOHN             DOE

In [160]:
# 3. MAP : works only on series
df['last'].map({"Thomas_updated": "Thomas", "Doe": "DOE_UDPATED"})

0         Thomas
1            NaN
2    DOE_UDPATED
Name: last, dtype: object

In [161]:
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

In [162]:
# 4. REPLACE : works only on series
df['last'].replace({"Thomas_updated": "Thomas", "Doe": "DOE_UDPATED"})

0           Thomas
1    Smith_latest2
2      DOE_UDPATED
Name: last, dtype: object

In [163]:
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

ADD REMOVE - ROWS/COLS FROM DF

In [164]:
df

                     email         first            last
0  JERINTHOMAS17@GMAIL.COM         Jerin  Thomas_updated
1      JOHNSMITH@EMAIL.COM  John_updated   Smith_latest2
2        JOHNDOE@EMAIL.COM          John             Doe

In [165]:
df['email'] = df['email'].apply(lambda x: x.lower())
df['first'] = df['first'].replace({"John_updated": "John"})
df['last'] =  df['last'].replace({"Thomas_updated": "Thomas", "Smith_latest2":"Smith"})
df

                     email  first    last
0  jerinthomas17@gmail.com  Jerin  Thomas
1      johnsmith@email.com   John   Smith
2        johndoe@email.com   John     Doe

In [166]:
df['full_name'] = df['first'] + ' ' + df['last']
df

                     email  first    last     full_name
0  jerinthomas17@gmail.com  Jerin  Thomas  Jerin Thomas
1      johnsmith@email.com   John   Smith    John Smith
2        johndoe@email.com   John     Doe      John Doe

In [167]:
df['number'] = 987654321
df

                     email  first    last     full_name     number
0  jerinthomas17@gmail.com  Jerin  Thomas  Jerin Thomas  987654321
1      johnsmith@email.com   John   Smith    John Smith  987654321
2        johndoe@email.com   John     Doe      John Doe  987654321

In [168]:
# Drop columns
df.drop(columns=['first', 'last'], inplace=True)
df

                     email     full_name     number
0  jerinthomas17@gmail.com  Jerin Thomas  987654321
1      johnsmith@email.com    John Smith  987654321
2        johndoe@email.com      John Doe  987654321

In [169]:
print(df['full_name'].str.split(' '))
print(df['full_name'].str.split(' ',expand=True))

0    [Jerin, Thomas]
1      [John, Smith]
2        [John, Doe]
Name: full_name, dtype: object
       0       1
0  Jerin  Thomas
1   John   Smith
2   John     Doe

In [170]:
df[['f_name', 'l_name']] = df['full_name'].str.split(' ',expand=True)
df

                     email     full_name     number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321   John   Smith
2        johndoe@email.com      John Doe  987654321   John     Doe

In [171]:
# Adding single row
df.append({'f_name':'Tony'}, ignore_index=True)

C:\Users\Jerin\AppData\Local\Temp\ipykernel_6400\2364624242.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'f_name':'Tony'}, ignore_index=True)

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3                      NaN           NaN          NaN   Tony     NaN

In [172]:
people2 = {
    "f_name": ["John1", "John2"],
    "l_name": ["Doe1", "Doe2"],
    "email": ["janedoe1@email.com", "johndoe2@email.com"]
}
df2 = pd.DataFrame(people2)
df2

  f_name l_name               email
0  John1   Doe1  janedoe1@email.com
1  John2   Doe2  johndoe2@email.com

In [173]:
# appending df to df2
df.append(df2, ignore_index=True, sort=False)

C:\Users\Jerin\AppData\Local\Temp\ipykernel_6400\1721858573.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

In [174]:
df

                     email     full_name     number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321   John   Smith
2        johndoe@email.com      John Doe  987654321   John     Doe

In [175]:
df = df.append(df2, ignore_index=True, sort=False)
df
# append has no inplace method

C:\Users\Jerin\AppData\Local\Temp\ipykernel_6400\3394495499.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

In [176]:
# removing rows
df.drop(index=4)
df

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

In [177]:
filt = df['l_name']=='Doe'
df.drop(index=df[filt].index)

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

SORTING

In [178]:
df.sort_values(by='l_name', ascending=False)

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
4       johndoe2@email.com           NaN          NaN  John2    Doe2
3       janedoe1@email.com           NaN          NaN  John1    Doe1
2        johndoe@email.com      John Doe  987654321.0   John     Doe

In [179]:
df

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

In [180]:
df.sort_values(by=['f_name', 'l_name'], ascending=False)

                     email     full_name       number f_name  l_name
4       johndoe2@email.com           NaN          NaN  John2    Doe2
3       janedoe1@email.com           NaN          NaN  John1    Doe1
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas

In [181]:
df.sort_values(by=['f_name', 'l_name'], ascending=[False, True], inplace=True)

In [182]:
df

                     email     full_name       number f_name  l_name
4       johndoe2@email.com           NaN          NaN  John2    Doe2
3       janedoe1@email.com           NaN          NaN  John1    Doe1
2        johndoe@email.com      John Doe  987654321.0   John     Doe
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas

In [183]:
df.sort_index()

                     email     full_name       number f_name  l_name
0  jerinthomas17@gmail.com  Jerin Thomas  987654321.0  Jerin  Thomas
1      johnsmith@email.com    John Smith  987654321.0   John   Smith
2        johndoe@email.com      John Doe  987654321.0   John     Doe
3       janedoe1@email.com           NaN          NaN  John1    Doe1
4       johndoe2@email.com           NaN          NaN  John2    Doe2

In [184]:
df['l_name'].sort_values()

2       Doe
3      Doe1
4      Doe2
1     Smith
0    Thomas
Name: l_name, dtype: object

Cleaning Data

In [185]:
import pandas as pd
import numpy as np

data = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}
df = pd.DataFrame(data)
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [186]:
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [187]:
# df.dropna(axis='index', how='any') #default values for dropna()
df.dropna(axis='index', how='all') #default values for dropna()
# if axis=columns with missing values

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [188]:
# drop columns for particular columns
df.dropna(axis='index', how='all', subset=['email', 'last']) 
# use inplace to change df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [193]:
# Custom misisng values: NA/Missing
df2 = pd.DataFrame(data)
df2.replace('NA', np.nan, inplace=True)
df2.replace('Missing', np.nan, inplace=True)
df2

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [197]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6  False  False  False  False

In [198]:
df2.dropna(axis='index', how='any', subset=['email', 'last'])

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [200]:
df2.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [201]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [202]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [209]:
df2['age'] = df2['age'].astype(float)
print(df2['age'].mean())
print()
print(df2.dtypes)

46.75

first     object
last      object
email     object
age      float64
dtype: object